# ETL Pipeline for College Rate of Return Analysis

In [1]:
import pandas as pd
import re

## Extract
Read the data into python using the pandas library.

In [2]:
salariesBycollegeCSV = "Resources/DS_WhereItPaysToAttendCollege/salaries-by-college-type.csv"
salariesBycollege_df = pd.read_csv(salariesBycollegeCSV)

college_AccTuitionCSV = "Resources/DS_USWorldReportCollegeData/College.csv"
college_AccTuition_df = pd.read_csv(college_AccTuitionCSV)

usa_rankingCSV = "Resources/NationalUniversitiesRankings.csv"
usa_ranking_df = pd.read_csv(usa_rankingCSV, encoding = "latin1")

The data file below is brought in to clean up NaN values later in the Transform section.

In [3]:
#bring in CSV for grabbing missing Acceptance rate for NaN values
#mostRecentDataCSV = "Resources/Most-Recent-Cohorts-All-Data-Elements.csv"
mostRecentDataCSV = "Resources/DS_collegescorecard_ed_gov/Most-Recent-Cohorts-All-Data-Elements.csv"
mostRecentData_df = pd.read_csv(mostRecentDataCSV,error_bad_lines=False, index_col=False, dtype='unicode')
#Grab the columns for admission rate and median earnings
mostADMrate_MDsalary_df = mostRecentData_df.loc[:,['INSTNM','ADM_RATE_ALL','MD_EARN_WNE_P10']]
mostADMrate_MDsalary_df.head()

                                INSTNM      ADM_RATE_ALL MD_EARN_WNE_P10
0             Alabama A & M University  0.87377537980974           31000
1  University of Alabama at Birmingham    0.581351094196           41200
2                   Amridge University               NaN           39600
3  University of Alabama in Huntsville  0.76281628162816           46700
4             Alabama State University    0.458963879377           27700

## Transform
* Remove columns that are not needed.
* Add a column to merge on that removes spaces and special characters and makes everything lowercase.
* Merge the tables together and clean up NaN values.

In [4]:
salariesBycollege_df.head()
#School Name, Starting Median Salary, Mid-Career Median Salary



salariesBycollege_df = salariesBycollege_df.loc[:, ['School Name', 'Starting Median Salary', 'Mid-Career Median Salary']]
salariesBycollege_df.head()

#salariesBycollege_df.describe #[269 rows x 3 columns]>

,School Name,Starting Median Salary,Mid-Career Median Salary
0,Massachusetts Institute of Technology (MIT),"$72,200.00","$126,000.00"
1,California Institute of Technology (CIT),"$75,500.00","$123,000.00"
2,Harvey Mudd College,"$71,800.00","$122,000.00"
3,"Polytechnic University of New York, Brooklyn","$62,400.00","$114,000.00"
4,Cooper Union,"$62,200.00","$114,000.00"

In [5]:
#Creating a column to merge on

for i, row in salariesBycollege_df.iterrows():
    
    #replaces () with nothing.. reference here: 
    #https://stackoverflow.com/questions/20894525/how-to-remove-parentheses-and-all-data-within-using-pandas-python
    salariesBycollege_df.loc[i, 'School Name'] = re.sub(r" ?\([^)]+\)", "", salariesBycollege_df.loc[i, 'School Name'])
    #Create a new column to remove spaces and special characters
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'School Name']
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].replace('-', '')
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].replace(' ', '')
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].replace('.', '')
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].replace('\'', '')
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].replace('&', '')
    salariesBycollege_df.loc[i, 'merge_name'] = salariesBycollege_df.loc[i, 'merge_name'].lower()
    
salariesBycollege_df.head()

,School Name,Starting Median Salary,Mid-Career Median Salary,merge_name
0,Massachusetts Institute of Technology,"$72,200.00","$126,000.00",massachusettsinstituteoftechnology
1,California Institute of Technology,"$75,500.00","$123,000.00",californiainstituteoftechnology
2,Harvey Mudd College,"$71,800.00","$122,000.00",harveymuddcollege
3,"Polytechnic University of New York, Brooklyn","$62,400.00","$114,000.00","polytechnicuniversityofnewyork,brooklyn"
4,Cooper Union,"$62,200.00","$114,000.00",cooperunion

In [6]:

#name, Private, Apps, Accept "AcpRate"
college_AccTuition_df.rename( columns={'Unnamed: 0':'Name'}, inplace=True )

college_accept_df = college_AccTuition_df.loc[:, ['Name', 'Private', 'Apps', 'Accept']]

college_accept_df['Acp_Rate(%)'] = round(college_accept_df['Accept'] / college_accept_df['Apps'] * 100,2)

college_accept_df.head()

                           Name Private  Apps  Accept  Acp_Rate(%)
0  Abilene Christian University     Yes  1660    1232        74.22
1            Adelphi University     Yes  2186    1924        88.01
2                Adrian College     Yes  1428    1097        76.82
3           Agnes Scott College     Yes   417     349        83.69
4     Alaska Pacific University     Yes   193     146        75.65

In [7]:
#Creating a column to merge on
for i, row in college_accept_df.iterrows():
    
    #Create a new column to remove spaces and special characters
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'Name']
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].replace('-', '')
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].replace(' ', '')
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].replace('.', '')
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].replace('\'', '')
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].replace('&', '')
    college_accept_df.loc[i, 'merge_name'] = college_accept_df.loc[i, 'merge_name'].lower()

college_accept_df.head()

,Name,Private,Apps,Accept,Acp_Rate(%),merge_name
0,Abilene Christian University,Yes,1660,1232,74.22,abilenechristianuniversity
1,Adelphi University,Yes,2186,1924,88.01,adelphiuniversity
2,Adrian College,Yes,1428,1097,76.82,adriancollege
3,Agnes Scott College,Yes,417,349,83.69,agnesscottcollege
4,Alaska Pacific University,Yes,193,146,75.65,alaskapacificuniversity

In [8]:
usa_ranking_df.head()
#Name, Location, Rank, Tuition and fees
usa_ranking_df = usa_ranking_df.loc[:,['Name', 'Location', 'Rank', 'Tuition and fees']]
usa_ranking_df.head()

                    Name       Location  Rank Tuition and fees
0   Princeton University  Princeton, NJ     1         $45,320
1     Harvard University  Cambridge, MA     2         $47,074
2  University of Chicago    Chicago, IL     3         $52,491
3        Yale University  New Haven, CT     3         $49,480
4    Columbia University   New York, NY     5         $55,056

In [9]:
#Create a column to merge on
for i, row in usa_ranking_df.iterrows():
    
    #Create a new column to remove spaces and special characters
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'Name']
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].replace('-', '')
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].replace(' ', '')
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].replace('.', '')
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].replace('\'', '')
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].replace('&', '')
    usa_ranking_df.loc[i, 'merge_name'] = usa_ranking_df.loc[i, 'merge_name'].lower()

usa_ranking_df.head()

,Name,Location,Rank,Tuition and fees,merge_name
0,Princeton University,"Princeton, NJ",1,"$45,320",princetonuniversity
1,Harvard University,"Cambridge, MA",2,"$47,074",harvarduniversity
2,University of Chicago,"Chicago, IL",3,"$52,491",universityofchicago
3,Yale University,"New Haven, CT",3,"$49,480",yaleuniversity
4,Columbia University,"New York, NY",5,"$55,056",columbiauniversity

### Start Merging

In [10]:
merged_df = usa_ranking_df.merge(college_accept_df, on='merge_name', how='left')
all_merged_df = merged_df.merge(salariesBycollege_df, on='merge_name', how='left')
all_merged_df.rename(columns={'Name_x': 'Name'}, inplace=True)
all_merged_df.drop(columns=['Name_y', 'School Name'], inplace=True)
all_merged_df

,Name,Location,Rank,Tuition and fees,merge_name,Private,Apps,Accept,Acp_Rate(%),Starting Median Salary,Mid-Career Median Salary
0,Princeton University,"Princeton, NJ",1,"$45,320",princetonuniversity,Yes,13218.0,2042.0,15.45,"$66,500.00","$131,000.00"
1,Harvard University,"Cambridge, MA",2,"$47,074",harvarduniversity,Yes,13865.0,2165.0,15.61,"$63,400.00","$124,000.00"
2,University of Chicago,"Chicago, IL",3,"$52,491",universityofchicago,Yes,6348.0,2999.0,47.24,NaN,NaN
3,Yale University,"New Haven, CT",3,"$49,480",yaleuniversity,Yes,10705.0,2453.0,22.91,"$59,100.00","$126,000.00"
4,Columbia University,"New York, NY",5,"$55,056",columbiauniversity,Yes,6756.0,1930.0,28.57,"$59,400.00","$107,000.00"
5,Stanford University,"Stanford, CA",5,"$47,940",stanforduniversity,NaN,NaN,NaN,NaN,NaN,NaN
6,Massachusetts Institute of Technology,"Cambridge, MA",7,"$48,452",massachusettsinstituteoftechnology,Yes,6411.0,2140.0,33.38,"$72,200.00","$126,000.00"
7,Duke University,"Durham, NC",8,"$51,265",dukeuniversity,Yes,13789.0,3893.0,28.23,NaN,NaN
8,University of Pennsylvania,"Philadelphia, PA",8,"$51,464",universityofpennsylvania,Yes,12394.0,5232.0,42.21,"$60,900.00","$120,000.00"
9,Johns Hopkins University,"Baltimore, MD",10,"$50,410",johnshopkinsuniversity,Yes,8474.0,3446.0,40.67,NaN,NaN
10,Dartmouth College,"Hanover, NH",11,"$51,438",dartmouthcollege,Yes,8587.0,2273.0,26.47,"$58,000.00","$134,000.00"
11,California Institute of Technology,"Pasadena, CA",12,"$47,577",californiainstituteoftechnology,NaN,NaN,NaN,NaN,"$75,500.00","$123,000.00"
12,Northwestern University,"Evanston, IL",12,"$50,855",northwesternuniversity,Yes,12289.0,5200.0,42.31,NaN,NaN
13,Brown University,"Providence, RI",14,"$51,367",brownuniversity,Yes,12586.0,3239.0,25.73,"$56,200.00","$109,000.00"
14,Cornell University,"Ithaca, NY",15,"$50,953",cornelluniversity,NaN,NaN,NaN,NaN,"$60,300.00","$110,000.00"
15,Rice University,"Houston, TX",15,"$43,918",riceuniversity,NaN,NaN,NaN,NaN,NaN,NaN
16,University of Notre Dame,"Notre Dame, IN",15,"$49,685",universityofnotredame,Yes,7700.0,3700.0,48.05,NaN,NaN
17,Vanderbilt University,"Nashville, TN",15,"$45,610",vanderbiltuniversity,Yes,7791.0,4690.0,60.20,NaN,NaN
18,Washington University in St. Louis,"St. Louis, MO",19,"$49,770",washingtonuniversityinstlouis,NaN,NaN,NaN,NaN,NaN,NaN
19,Emory University,"Atlanta, GA",20,"$47,954",emoryuniversity,Yes,8506.0,4168.0,49.00,NaN,NaN
20,Georgetown University,"Washington, DC",20,"$50,547",georgetownuniversity,Yes,11115.0,2881.0,25.92,NaN,NaN
21,University of California--Berkeley,"Berkeley, CA",20,"$40,191",universityofcaliforniaberkeley,NaN,NaN,NaN,NaN,NaN,NaN
22,University of Southern California,"Los Angeles, CA",23,"$52,217",universityofsoutherncalifornia,Yes,12229.0,8498.0,69.49,NaN,NaN
23,Carnegie Mellon University,"Pittsburgh, PA",24,"$52,040",carnegiemellonuniversity,Yes,8728.0,5201.0,59.59,"$61,800.00","$111,000.00"
24,University of California--Los Angeles,"Los Angeles, CA",24,"$39,518",universityofcalifornialosangeles,NaN,NaN,NaN,NaN,NaN,NaN
25,University of Virginia,"Charlottesville, VA",24,"$45,066",universityofvirginia,No,15849.0,5384.0,33.97,"$52,700.00","$103,000.00"
26,Tufts University,"Medford, MA",27,"$52,430",tuftsuniversity,NaN,NaN,NaN,NaN,NaN,NaN
27,University of Michigan--Ann Arbor,"Ann Arbor, MI",27,"$43,476",universityofmichiganannarbor,NaN,NaN,NaN,NaN,NaN,NaN
28,Wake Forest University,"Winston-Salem, NC",27,"$49,308",wakeforestuniversity,Yes,5661.0,2392.0,42.25,NaN,NaN
29,University of North Carolina--Chapel Hill,"Chapel Hill, NC",30,"$33,916",universityofnorthcarolinachapelhill,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
211,California State University--Fullerton,"Fullerton, CA",202,"$17,596",californiastateuniversityfullerton,NaN,NaN,NaN,NaN,NaN,NaN
212,Central Michigan University,"Mount Pleasant, MI",202,"$23,670",centralmichiganuniversity,NaN,NaN,NaN,NaN,NaN,NaN
213,Louisiana Tech University,"Ruston, LA",202,"$25,851",louisianatechuniversity,No,2397.0,2144.0,89.45,NaN,NaN
214,South Dakota State University,"Brookings, SD",202,"$11,403",southdakotastateuniversity,No,2807.0,2589.0,92.23,"$41,100.00","$73,500.00"
215,University of Alaska--Fairbanks,"Fairbanks, AK",202,"$22,469",universityofalaskafairbanks,NaN,NaN,NaN,NaN,NaN,NaN
216,University of North Carolina--Charlotte,"Charlotte, NC",202,"$20,193",universityofnorthcarolinacharlotte,NaN,NaN,NaN,NaN,NaN,NaN
217,University of North Dakota,"Grand Forks, ND",202,"$18,899",universityofnorthdakota,No,2777.0,2249.0,80.99,"$44,000.00","$80,600.00"
218,University of South Dakota,"Vermillion, SD",202,"$11,688",universityofsouthdakota,NaN,NaN,NaN,NaN,NaN,NaN
219,East Carolina University,"Greenville, NC",210,"$22,904",eastcarolinauniversity,No,9274.0,6362.0,68.60,"$40,200.00","$67,500.00"
220,Montana State University,"Bozeman, MT",210,"$23,042",montanastateuniversity,No,3500.0,2836.0,81.03,NaN,NaN
221,Old Dominion University,"Norfolk, VA",210,"$27,028",olddominionuniversity,NaN,NaN,NaN,NaN,NaN,NaN
222,University of Missouri--Kansas City,"Kansas City, MO",210,"$22,714",universityofmissourikansascity,NaN,NaN,NaN,NaN,"$38,900.00","$65,800.00"
223,Ashland University,"Ashland, OH",214,"$20,392",ashlanduniversity,NaN,NaN,NaN,NaN,NaN,NaN
224,Dallas Baptist University,"Dallas, TX",214,"$26,180",dallasbaptistuniversity,NaN,NaN,NaN,NaN,NaN,NaN
225,Northern Illinois University,"DeKalb, IL",214,"$23,799",northernillinoisuniversity,No,10706.0,7219.0,67.43,"$43,600.00","$80,800.00"
226,Nova Southeastern University,"Ft. Lauderdale, FL",214,"$27,660",novasoutheasternuniversity,NaN,NaN,NaN,NaN,NaN,NaN
227,Southern Illinois University--Carbondale,"Carbondale, IL",214,"$27,130",southernillinoisuniversitycarbondale,NaN,NaN,NaN,NaN,"$43,000.00","$72,500.00"
228,University of Montana,"Missoula, MT",214,"$24,562",universityofmontana,NaN,NaN,NaN,NaN,"$37,300.00","$71,900.00"
229,Benedictine University,"Lisle, IL",220,"$32,170",benedictineuniversity,NaN,NaN,NaN,NaN,NaN,NaN
230,California State University--Fresno,"Fresno, CA",220,"$17,209",californiastateuniversityfresno,NaN,NaN,NaN,NaN,NaN,NaN
231,Gardner-Webb University,"Boiling Springs, NC",220,"$29,850",gardnerwebbuniversity,Yes,1110.0,930.0,83.78,NaN,NaN
232,New Mexico State University,"Las Cruces, NM",220,"$21,234",newmexicostateuniversity,NaN,NaN,NaN,NaN,"$44,300.00","$79,500.00"
233,Shenandoah University,"Winchester, VA",220,"$31,322",shenandoahuniversity,NaN,NaN,NaN,NaN,NaN,NaN
234,Tennessee Technological University,"Cookeville, TN",220,"$24,800",tennesseetechnologicaluniversity,NaN,NaN,NaN,NaN,"$46,200.00","$80,000.00"
235,University of Massachusetts--Boston,"Boston, MA",220,"$32,023",universityofmassachusettsboston,NaN,NaN,NaN,NaN,"$45,600.00","$78,200.00"
236,University of Massachusetts--Dartmouth,"North Dartmouth, MA",220,"$19,270",universityofmassachusettsdartmouth,NaN,NaN,NaN,NaN,"$43,200.00","$77,700.00"
237,University of Missouri--St. Louis,"St. Louis, MO",220,"$26,277",universityofmissouristlouis,NaN,NaN,NaN,NaN,"$41,400.00","$67,100.00"
238,University of North Carolina--Greensboro,"Greensboro, NC",220,"$21,595",universityofnorthcarolinagreensboro,NaN,NaN,NaN,NaN,NaN,NaN
239,University of Southern Mississippi,"Hattiesburg, MS",220,"$16,094",universityofsouthernmississippi,No,2850.0,2044.0,71.72,NaN,NaN
240,Utah State University,"Logan, UT",220,"$19,772",utahstateuniversity,NaN,NaN,NaN,NaN,"$43,800.00","$78,700.00"

In [11]:
# Check for NaN values
all_merged_df.isnull().sum()

Name                          0
Location                      0
Rank                          0
Tuition and fees              0
merge_name                    0
Private                     123
Apps                        123
Accept                      123
Acp_Rate(%)                 123
Starting Median Salary      144
Mid-Career Median Salary    144
dtype: int64

### Data improvement from another resource in effort to reduce the amount of "NaN" values

In [12]:
#Creating a column to merge on
for i, row in mostADMrate_MDsalary_df.iterrows():
    
    #Create a new column to remove spaces and special characters
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'INSTNM']
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].replace('-', '')
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].replace(' ', '')
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].replace('.', '')
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].replace('\'', '')
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].replace('&', '')
    mostADMrate_MDsalary_df.loc[i, 'merge_name'] = mostADMrate_MDsalary_df.loc[i, 'merge_name'].lower()
    
mostADMrate_MDsalary_df.head()

,INSTNM,ADM_RATE_ALL,MD_EARN_WNE_P10,merge_name
0,Alabama A & M University,0.87377537980974,31000,alabamaamuniversity
1,University of Alabama at Birmingham,0.581351094196,41200,universityofalabamaatbirmingham
2,Amridge University,NaN,39600,amridgeuniversity
3,University of Alabama in Huntsville,0.76281628162816,46700,universityofalabamainhuntsville
4,Alabama State University,0.458963879377,27700,alabamastateuniversity

In [13]:
#get list of schools with NaN values in the salary column

missingSalaryDatalist = []

missingSalaryData = pd.isnull(all_merged_df['Starting Median Salary'])

for i, row in enumerate(missingSalaryData):
    if row == True:
        
        for x, stuff in all_merged_df.iterrows():
            if x == i:
                #print(stuff['Name'])
                missingSalaryDatalist.append(stuff['merge_name'])
                
print(len(missingSalaryDatalist))

144

In [14]:
#get list of schools with NaN values in the admission rate column

missingAdmDatalist = []

missingAdmData = pd.isnull(all_merged_df['Acp_Rate(%)'])

for i, row in enumerate(missingAdmData):
    if row == True:
        
        for x, stuff in all_merged_df.iterrows():
            if x == i:
                #print(stuff['Name'])
                missingAdmDatalist.append(stuff['merge_name'])
                
print(len(missingAdmDatalist))

123

In [15]:
#Grab missing salary data from mostADMrate_MDsalary_df
missingMDsalary = {}

for i, row in mostADMrate_MDsalary_df.iterrows():
    
    for line in missingSalaryDatalist:
        
        if row[3] == line:
            #Format to currency while pulling data
            #Some rows had the string 'PrivacySuppressed' instead of a number - replace with NaN
            if row[2] == 'PrivacySuppressed':
                missingMDsalary.update({line: 'NaN'})
            elif row[2][0] != '$':
                row[2] = float(row[2])
                row[2] = '${:,.2f}'.format(row[2])
                missingMDsalary.update({line:row[2]})
            else:
                missingMDsalary.update({line:row[2]})

#remove added NaN values
update_missingMDsalary = {}
for key in missingMDsalary:
    if missingMDsalary[key] != 'NaN':
        update_missingMDsalary[key] = missingMDsalary[key]
        
print(len(update_missingMDsalary))

111

In [16]:
#Grab missing admission rate from mostADMrate_MDsalary_df

missingADMrate = {}

for i, row in mostADMrate_MDsalary_df.iterrows():
    
    for line in missingAdmDatalist:
        
        if row[3] == line:
            row[1] = float(row[1])
            row[1] = round(row[1] * 100,2)
            missingADMrate.update({line:row[1]})
            
if 'Benedictine University' in missingADMrate: 
    del missingADMrate['Benedictine University']
            
print(len(missingADMrate))

84

In [17]:
#if Acp_Rate(%) has a NaN value and a new value in missingADMrate, map and replace the NaN value
all_merged_df.loc[all_merged_df['Acp_Rate(%)'].isnull(), 'Acp_Rate(%)'] = all_merged_df['merge_name'].map(missingADMrate)
all_merged_df.loc[all_merged_df['Starting Median Salary'].isnull(), 'Starting Median Salary'] = all_merged_df['merge_name'].map(update_missingMDsalary)

### Final result of cleaning up NaN values
* Roughly 75% of the data was recovered for the Acp_Rate and Staring Salary columns

In [18]:
all_merged_df.isnull().sum()

Name                          0
Location                      0
Rank                          0
Tuition and fees              0
merge_name                    0
Private                     123
Apps                        123
Accept                      123
Acp_Rate(%)                  38
Starting Median Salary       33
Mid-Career Median Salary    144
dtype: int64

In [19]:
#final formating to remove merge_name column
all_merged_df.drop(columns=['merge_name'], inplace=True)
all_merged_df

,Name,Location,Rank,Tuition and fees,Private,Apps,Accept,Acp_Rate(%),Starting Median Salary,Mid-Career Median Salary
0,Princeton University,"Princeton, NJ",1,"$45,320",Yes,13218.0,2042.0,15.45,"$66,500.00","$131,000.00"
1,Harvard University,"Cambridge, MA",2,"$47,074",Yes,13865.0,2165.0,15.61,"$63,400.00","$124,000.00"
2,University of Chicago,"Chicago, IL",3,"$52,491",Yes,6348.0,2999.0,47.24,"$68,100.00",NaN
3,Yale University,"New Haven, CT",3,"$49,480",Yes,10705.0,2453.0,22.91,"$59,100.00","$126,000.00"
4,Columbia University,"New York, NY",5,"$55,056",Yes,6756.0,1930.0,28.57,"$59,400.00","$107,000.00"
5,Stanford University,"Stanford, CA",5,"$47,940",NaN,NaN,NaN,4.81,"$94,000.00",NaN
6,Massachusetts Institute of Technology,"Cambridge, MA",7,"$48,452",Yes,6411.0,2140.0,33.38,"$72,200.00","$126,000.00"
7,Duke University,"Durham, NC",8,"$51,265",Yes,13789.0,3893.0,28.23,"$84,400.00",NaN
8,University of Pennsylvania,"Philadelphia, PA",8,"$51,464",Yes,12394.0,5232.0,42.21,"$60,900.00","$120,000.00"
9,Johns Hopkins University,"Baltimore, MD",10,"$50,410",Yes,8474.0,3446.0,40.67,"$73,200.00",NaN
10,Dartmouth College,"Hanover, NH",11,"$51,438",Yes,8587.0,2273.0,26.47,"$58,000.00","$134,000.00"
11,California Institute of Technology,"Pasadena, CA",12,"$47,577",NaN,NaN,NaN,8.07,"$75,500.00","$123,000.00"
12,Northwestern University,"Evanston, IL",12,"$50,855",Yes,12289.0,5200.0,42.31,"$69,000.00",NaN
13,Brown University,"Providence, RI",14,"$51,367",Yes,12586.0,3239.0,25.73,"$56,200.00","$109,000.00"
14,Cornell University,"Ithaca, NY",15,"$50,953",NaN,NaN,NaN,14.09,"$60,300.00","$110,000.00"
15,Rice University,"Houston, TX",15,"$43,918",NaN,NaN,NaN,15.27,"$65,400.00",NaN
16,University of Notre Dame,"Notre Dame, IN",15,"$49,685",Yes,7700.0,3700.0,48.05,"$78,400.00",NaN
17,Vanderbilt University,"Nashville, TN",15,"$45,610",Yes,7791.0,4690.0,60.20,"$69,000.00",NaN
18,Washington University in St. Louis,"St. Louis, MO",19,"$49,770",NaN,NaN,NaN,16.53,"$70,100.00",NaN
19,Emory University,"Atlanta, GA",20,"$47,954",Yes,8506.0,4168.0,49.00,"$66,000.00",NaN
20,Georgetown University,"Washington, DC",20,"$50,547",Yes,11115.0,2881.0,25.92,"$93,500.00",NaN
21,University of California--Berkeley,"Berkeley, CA",20,"$40,191",NaN,NaN,NaN,16.93,"$64,700.00",NaN
22,University of Southern California,"Los Angeles, CA",23,"$52,217",Yes,12229.0,8498.0,69.49,"$74,000.00",NaN
23,Carnegie Mellon University,"Pittsburgh, PA",24,"$52,040",Yes,8728.0,5201.0,59.59,"$61,800.00","$111,000.00"
24,University of California--Los Angeles,"Los Angeles, CA",24,"$39,518",NaN,NaN,NaN,17.99,"$60,700.00",NaN
25,University of Virginia,"Charlottesville, VA",24,"$45,066",No,15849.0,5384.0,33.97,"$52,700.00","$103,000.00"
26,Tufts University,"Medford, MA",27,"$52,430",NaN,NaN,NaN,14.29,"$75,800.00",NaN
27,University of Michigan--Ann Arbor,"Ann Arbor, MI",27,"$43,476",NaN,NaN,NaN,28.59,"$63,400.00",NaN
28,Wake Forest University,"Winston-Salem, NC",27,"$49,308",Yes,5661.0,2392.0,42.25,"$63,800.00",NaN
29,University of North Carolina--Chapel Hill,"Chapel Hill, NC",30,"$33,916",NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
211,California State University--Fullerton,"Fullerton, CA",202,"$17,596",NaN,NaN,NaN,48.23,"$47,200.00",NaN
212,Central Michigan University,"Mount Pleasant, MI",202,"$23,670",NaN,NaN,NaN,71.56,"$41,900.00",NaN
213,Louisiana Tech University,"Ruston, LA",202,"$25,851",No,2397.0,2144.0,89.45,"$41,500.00",NaN
214,South Dakota State University,"Brookings, SD",202,"$11,403",No,2807.0,2589.0,92.23,"$41,100.00","$73,500.00"
215,University of Alaska--Fairbanks,"Fairbanks, AK",202,"$22,469",NaN,NaN,NaN,73.47,"$38,700.00",NaN
216,University of North Carolina--Charlotte,"Charlotte, NC",202,"$20,193",NaN,NaN,NaN,NaN,NaN,NaN
217,University of North Dakota,"Grand Forks, ND",202,"$18,899",No,2777.0,2249.0,80.99,"$44,000.00","$80,600.00"
218,University of South Dakota,"Vermillion, SD",202,"$11,688",NaN,NaN,NaN,88.13,"$42,000.00",NaN
219,East Carolina University,"Greenville, NC",210,"$22,904",No,9274.0,6362.0,68.60,"$40,200.00","$67,500.00"
220,Montana State University,"Bozeman, MT",210,"$23,042",No,3500.0,2836.0,81.03,"$43,200.00",NaN
221,Old Dominion University,"Norfolk, VA",210,"$27,028",NaN,NaN,NaN,84.64,"$43,700.00",NaN
222,University of Missouri--Kansas City,"Kansas City, MO",210,"$22,714",NaN,NaN,NaN,61.87,"$38,900.00","$65,800.00"
223,Ashland University,"Ashland, OH",214,"$20,392",NaN,NaN,NaN,72.47,"$40,400.00",NaN
224,Dallas Baptist University,"Dallas, TX",214,"$26,180",NaN,NaN,NaN,43.11,"$43,200.00",NaN
225,Northern Illinois University,"DeKalb, IL",214,"$23,799",No,10706.0,7219.0,67.43,"$43,600.00","$80,800.00"
226,Nova Southeastern University,"Ft. Lauderdale, FL",214,"$27,660",NaN,NaN,NaN,52.54,"$45,300.00",NaN
227,Southern Illinois University--Carbondale,"Carbondale, IL",214,"$27,130",NaN,NaN,NaN,76.65,"$43,000.00","$72,500.00"
228,University of Montana,"Missoula, MT",214,"$24,562",NaN,NaN,NaN,NaN,"$37,300.00","$71,900.00"
229,Benedictine University,"Lisle, IL",220,"$32,170",NaN,NaN,NaN,NaN,"$49,000.00",NaN
230,California State University--Fresno,"Fresno, CA",220,"$17,209",NaN,NaN,NaN,53.54,"$44,700.00",NaN
231,Gardner-Webb University,"Boiling Springs, NC",220,"$29,850",Yes,1110.0,930.0,83.78,"$38,700.00",NaN
232,New Mexico State University,"Las Cruces, NM",220,"$21,234",NaN,NaN,NaN,NaN,"$44,300.00","$79,500.00"
233,Shenandoah University,"Winchester, VA",220,"$31,322",NaN,NaN,NaN,88.02,"$45,800.00",NaN
234,Tennessee Technological University,"Cookeville, TN",220,"$24,800",NaN,NaN,NaN,67.21,"$46,200.00","$80,000.00"
235,University of Massachusetts--Boston,"Boston, MA",220,"$32,023",NaN,NaN,NaN,68.52,"$45,600.00","$78,200.00"
236,University of Massachusetts--Dartmouth,"North Dartmouth, MA",220,"$19,270",NaN,NaN,NaN,76.02,"$43,200.00","$77,700.00"
237,University of Missouri--St. Louis,"St. Louis, MO",220,"$26,277",NaN,NaN,NaN,70.62,"$41,400.00","$67,100.00"
238,University of North Carolina--Greensboro,"Greensboro, NC",220,"$21,595",NaN,NaN,NaN,NaN,NaN,NaN
239,University of Southern Mississippi,"Hattiesburg, MS",220,"$16,094",No,2850.0,2044.0,71.72,"$36,400.00",NaN
240,Utah State University,"Logan, UT",220,"$19,772",NaN,NaN,NaN,90.25,"$43,800.00","$78,700.00"

## Load
* Write the final pandas dataframe into a CSV file.
* The final table can be now be used for visual analysis for which of the top ranked universities/college give you the best value

In [20]:
all_merged_df.to_csv('Results/Final_College_Data.csv', encoding='utf-8')